app/views/books/_form.html.erb


<%= f.collection_select :type_id, Type.all, :id, :btype, {prompt: "Select a category"}, {class: "form-control"} %>
---
SELECT "types".* FROM "types"