app/controllers/books_controller.rb

  def index
    #@books = Book.all
    @books = Book.search(params[:keyword])
---
SELECT "books".* FROM "books"  WHERE (keywords LIKE '%1%')

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("author", "created_at", "descritpion", "keywords", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["author", ""], ["created_at", "2014-08-29 05:04:14.113056"], ["descritpion", ""], ["keywords", "  "], ["title", ""], ["updated_at", "2014-08-29 05:04:14.113056"]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "keywords" = ?, "updated_at" = ? WHERE "books"."id" = 1  [["keywords", "1 2 3"], ["updated_at", "2014-08-27 04:04:37.928296"]]